[
  {
    "plantName": "Lavender",
    "description": "Lavender is a perfect addition to Victorian spring gardens thanks to its fragrance, drought tolerance, and pollinator-friendly nature. Choose a sunny location with well-draining, slightly alkaline soil (pH 6.5–8.0). Heavy clay soils should be amended with sand or gravel to improve drainage. Plant in early to mid-spring once the risk of frost has passed. Space each plant around 30–45 cm apart to allow airflow and reduce the chance of fungal issues. Water young plants regularly until established, then reduce watering—lavender thrives on neglect. Avoid high-nitrogen fertilizers; instead, use a slow-release general-purpose type sparingly. Prune after flowering to maintain a compact shape and encourage bushier growth. Lavender not only adds beauty and scent to your garden, but it also deters pests and attracts bees, making it a great companion for vegetables and fruit trees. With minimal care, it will bloom generously throughout spring and summer."
  },
  {
    "plantName": "Rose",
    "description": "Roses flourish in Victoria's spring and bring elegance, color, and fragrance to any garden. Choose a position with full sun—ideally 6 hours or more of direct sunlight daily—and well-drained, nutrient-rich soil. Before planting, dig compost or aged manure into the soil to support healthy root development. Plant roses at the same depth they were in their nursery pot, and space them 60–90 cm apart to promote air circulation and reduce disease. Water deeply once or twice a week, especially during dry spells, keeping water at the base to avoid fungal issues. Apply mulch to conserve moisture and suppress weeds. Feed with a rose-specific fertilizer every 4–6 weeks through spring and early summer. Prune in late winter or early spring, removing dead, weak, or crossing branches. With regular care, roses reward you with stunning blooms that make excellent cut flowers and focal points in your garden."
  },
  {
    "plantName": "Camellia",
    "description": "Camellias are prized for their glossy evergreen foliage and striking flowers that bloom in late winter through spring. They thrive in Victoria's temperate climate when planted in filtered light or morning sun, away from harsh afternoon exposure. The soil should be slightly acidic (pH 5.5–6.5), rich in organic matter, and well-draining. Plant camellias slightly above soil level to avoid crown rot, and mulch with pine bark or leaf litter to keep roots cool and moist. Water regularly during the growing season, especially in dry weather, but avoid waterlogging. Fertilize after flowering using an acid-loving plant food. Prune lightly after blooming to shape the plant and encourage bushiness. Camellias are perfect for borders, hedges, or as specimen plants in shaded corners of the garden. Their elegant flowers and year-round structure make them a garden favorite throughout Victoria’s cooler months and into spring."
  },
  {
    "plantName": "Grevillea",
    "description": "Grevilleas are tough, low-maintenance native plants that bloom beautifully in Victoria’s spring gardens. They prefer full sun and free-draining soil—sandy or loamy types are ideal. Avoid planting in rich or wet soil and use a low-phosphorus fertilizer specially designed for Australian natives. Spring is the best time to plant, giving roots time to settle before the dry summer. Once established, grevilleas are drought-tolerant and only need occasional watering. Apply a thick layer of mulch to conserve soil moisture, but keep it away from the stem base. Prune lightly after flowering to maintain a neat shape and stimulate new growth. Grevilleas are loved by nectar-feeding birds, especially honeyeaters, making them excellent for wildlife-friendly gardens. With their spidery or toothbrush-like blooms in vibrant reds, yellows, and pinks, grevilleas provide continuous interest and color with minimal care. Dwarf varieties also suit small gardens or pots."
  },
  {
    "plantName": "Tomato",
    "description": "Tomatoes thrive in Victoria’s warm, sunny summers, making them a staple in backyard veggie patches. Choose a location that receives at least 6–8 hours of direct sunlight daily. Plant tomatoes in rich, well-draining soil enriched with compost or aged manure. Space plants 45–60 cm apart to allow good air circulation and reduce disease risk. Use stakes or cages to support growth and prevent fruit from touching the ground. Water consistently at the base—early morning is ideal—keeping the soil evenly moist but not soggy. Mulch around plants to conserve moisture and suppress weeds. Feed with a balanced or tomato-specific fertilizer every two to three weeks. Regularly prune side shoots to encourage stronger, upright growth and larger fruit. Watch for pests like aphids or caterpillars and remove them early. With proper care, you can enjoy juicy, homegrown tomatoes all summer long—perfect for salads, sauces, and snacks."
  },
  {
    "plantName": "Agapanthus",
    "description": "Agapanthus, also known as Lily of the Nile, is a hardy and reliable plant for Victoria’s hot summers. It thrives in full sun to part shade and tolerates drought once established. Plant in well-drained soil, spacing clumps around 30–60 cm apart depending on variety. Spring or early summer is the ideal time for planting. Water regularly during establishment, then reduce frequency—overwatering can cause rot. Agapanthus requires minimal maintenance but benefits from occasional feeding with a slow-release fertilizer in spring. Remove spent flower stalks to encourage more blooms and prevent self-seeding. The strappy green leaves remain lush throughout the year, and the striking blue or white flowers bloom in mid-to-late summer. It works well in garden borders, along pathways, or in containers. Agapanthus is also excellent for coastal gardens thanks to its resilience to salty winds and heat. Divide overcrowded clumps every few years to rejuvenate flowering."
  },
  {
    "plantName": "Olive Tree",
    "description": "Olive trees are well-suited to Victoria’s dry, sunny summers, offering both ornamental beauty and edible rewards. Choose a location with full sun and excellent drainage—olives dislike waterlogged roots. Plant in well-drained, sandy or loamy soil, and avoid overly rich soils. Space trees at least 3–5 meters apart to allow room for mature growth. Water regularly in the first year, especially during dry spells, then reduce as the tree becomes drought-tolerant. Apply mulch around the base to retain moisture but keep it clear of the trunk. Fertilize in spring with a low-nitrogen fertilizer to support fruiting. Prune lightly in late winter or early spring to shape and remove any dead or crossing branches. Olive trees are slow-growing and can live for decades, making them a lasting feature in your backyard. They can be grown in large pots, too—just ensure good drainage and full sun exposure."
  },
  {
    "plantName": "Succulents",
    "description": "Succulents are perfect for low-maintenance summer gardens in Victoria, especially during dry or water-restricted months. They thrive in full sun to partial shade and prefer gritty, free-draining soil—amend clay soils with sand or perlite to improve drainage. Plant in summer when the risk of frost has passed, and choose a mix of rosette-forming, trailing, or upright varieties for visual interest. Succulents store water in their leaves, so avoid overwatering; once every 10–14 days is usually enough during summer. Use shallow containers or raised beds for optimal drainage. Fertilize sparingly in spring or early summer using a diluted, low-nitrogen fertilizer. Remove spent leaves and check for pests like mealybugs. Many succulents also produce striking flowers in summer, adding pops of color to your landscape. Whether in pots, rock gardens, or vertical walls, succulents are an excellent choice for vibrant, drought-resilient backyard displays."
  },
  {
    "plantName": "Kangaroo Paw",
    "description": "Kangaroo Paw is an iconic Australian native that adds bold texture and vibrant color to Victorian autumn gardens. Plant in a sunny location with well-drained, sandy or loamy soil. Autumn is a great time to plant as it allows the roots to establish before the dry summer. Choose a low-phosphorus fertilizer suitable for native plants and avoid overwatering—these plants are drought-tolerant once established. Water deeply but infrequently during the first growing season. Remove spent flowers regularly to encourage new blooms and extend flowering into early winter. After flowering, cut old stems back to the base to promote fresh growth. Kangaroo Paw attracts birds and pollinators, making it a wildlife-friendly addition to your garden. Compact varieties suit pots or borders, while taller species make striking focal points. To avoid fungal diseases, ensure good air circulation and do not let water sit on leaves or crowns."
  },
  {
    "plantName": "Climbing Roses",
    "description": "Climbing Roses bring vertical beauty and long-lasting blooms to backyard fences, walls, or arbors. Autumn is an excellent time to plant them in Victoria, giving roots a head start before winter. Select a sunny location with at least 6 hours of direct light per day. Ensure the soil is well-drained and enriched with compost. When planting, position the graft union just above soil level and secure stems loosely to a trellis or support. Water thoroughly after planting and mulch to retain moisture. Water regularly during dry spells, keeping the base moist but not soggy. Feed in early spring with a balanced rose fertilizer. Prune lightly after flowering to remove dead wood and train new growth horizontally for more blooms. Climbing roses offer a stunning cascade of color and fragrance, rewarding you with dramatic floral displays season after season."
  },
  {
    "plantName": "Lilly Pilly",
    "description": "Lilly Pilly is a versatile, fast-growing Australian native ideal for hedges, screens, or ornamental plantings in Victorian gardens. Autumn is an ideal planting season, offering mild weather for root development. Choose a sunny to partly shaded position with well-drained soil. Enrich the soil with compost before planting, and water in well. Young plants require regular watering during their first year, especially in dry conditions. Mulch around the base to conserve moisture and suppress weeds, keeping mulch away from the trunk. Lilly Pilly benefits from light pruning to shape and encourage dense growth—best done after new flushes of growth. It produces small white or cream flowers followed by colorful berries, which attract birds. Use a low-phosphorus native fertilizer in spring and autumn. With glossy leaves, vibrant flushes of red or bronze new foliage, and easy maintenance, Lilly Pilly is an autumn favorite for both formal and informal gardens."
  },
  {
    "plantName": "Bay Tree",
    "description": "Bay trees are hardy, aromatic evergreens perfect for Victorian backyards, whether grown in the ground or containers. Autumn planting allows roots to establish before summer stress. Choose a sunny or partly shaded location with fertile, well-drained soil. Bay trees tolerate a variety of soil types but dislike soggy conditions—elevate or mound if necessary. Water well after planting and keep the soil consistently moist during the first growing season. Mature trees are drought-tolerant but benefit from occasional deep watering. Prune lightly in late autumn or spring to maintain shape or encourage bushy growth, especially if used as a hedge or topiary. Fertilize once in spring with a balanced organic fertilizer. Bay trees grow slowly but reward gardeners with fragrant leaves used in cooking. They’re highly adaptable, evergreen year-round, and lend a Mediterranean touch to Victorian autumn gardens."
  },
  {
    "plantName": "Mint",
    "description": "Mint is a hardy perennial herb that thrives in Victoria’s cool winter climate. It grows best in moist, well-drained soil with plenty of organic matter and partial to full sunlight. Winter is an excellent time to plant mint as it can establish its root system before spring growth kicks in. Mint spreads vigorously, so it’s best planted in containers or confined beds to prevent it from becoming invasive. Keep the soil evenly moist but not waterlogged. Regular harvesting encourages bushier growth—pinch off leaves and stems as needed. Although mint may die back slightly during colder months, it will regrow vigorously in spring. Add a layer of mulch to protect the roots from frost. Mint is perfect for garden borders, kitchen pots, or companion planting, as it repels some common pests. Its refreshing aroma and culinary uses make it a must-have winter herb for backyard gardeners."
  },
  {
    "plantName": "Chives",
    "description": "Chives are an easy-to-grow, winter-hardy herb perfect for Victoria’s cool-season gardens. Plant them in well-drained soil with good sunlight exposure—at least 4–6 hours per day. Winter planting allows roots to settle before the growth surge in spring. Sow seeds directly or plant divisions from mature clumps. Keep soil slightly moist during germination and growth. Chives form clumps of slender, green, onion-flavored leaves and produce purple pom-pom flowers in spring. Trim leaves regularly to encourage new growth and prevent the plant from becoming too woody. They’re great for pots, borders, or herb gardens and are excellent companions for carrots, tomatoes, and lettuce. In cold winters, chives may go dormant, but they reliably regrow in spring. Add a layer of mulch in late autumn for frost protection. Chives are not only edible but also ornamental, and their flowers attract pollinators, making them a great all-round herb for winter gardens."
  },
  {
    "plantName": "Thyme",
    "description": "Thyme is a resilient, low-growing perennial herb ideal for planting in Victoria during winter. It thrives in full sun and well-drained, slightly alkaline soil. Winter planting gives thyme time to develop a strong root system before spring. Choose a sunny spot and avoid heavy clay—raised beds or sandy soils are ideal. Once established, thyme is drought-tolerant and needs only occasional watering. Avoid overwatering, especially during wet winters, to prevent root rot. Prune lightly after flowering to maintain a compact shape. Thyme is perfect for rock gardens, borders, or even between stepping stones thanks to its creeping habit and fragrant leaves. It’s also an excellent companion plant for vegetables, deterring pests like cabbage moths. Mulch with gravel or light straw to insulate roots during frosty nights. This aromatic herb adds flavor to winter stews and roasts, and its evergreen nature brings life to your winter garden."
  },
  {
    "plantName": "Native Grasses",
    "description": "Native grasses are excellent for low-maintenance, drought-tolerant winter planting in Victoria. They thrive in various conditions, including sandy, loamy, or even poor soils, and many tolerate frost well. Autumn through winter is the best time to plant native grasses, giving them a full cool season to establish roots. Choose a sunny or part-shade location and plant in well-drained soil. Water regularly during establishment, then only during prolonged dry periods. Popular varieties for Victorian gardens include Lomandra, Themeda, and Poa species. These grasses provide year-round structure and texture, offering habitat for insects and small birds. Most require little fertiliser—use a native slow-release type in early spring if needed. Trim old foliage in late winter to promote fresh, green regrowth. Native grasses blend beautifully with other native shrubs or flowering perennials and are ideal for naturalistic or wildlife-friendly landscaping. They bring movement, color, and resilience to the winter garden."
  },
  {
    "plantName": "Frangipani",
    "description": "Frangipani (Plumeria) is a classic tropical tree that thrives in Queensland’s warm spring climate. It loves full sun and requires well-drained, sandy or loamy soil. Spring is the best time to plant, as rising temperatures encourage root growth. Choose a location with good airflow and space for spreading branches. Frangipanis are drought-tolerant once established and prefer minimal watering—let the soil dry out between drinks. They don’t need much fertilising, but a light application of a slow-release fertilizer in spring can boost flowering. Prune lightly to shape in late winter or early spring, but avoid cutting into thick, older wood. Frangipanis produce fragrant blooms in white, pink, yellow, or red from late spring through summer. Ideal for tropical-themed gardens or containers, they’re low-maintenance and pest-resistant. Note: their sap is toxic, so wear gloves when pruning. With their iconic scent and stunning appearance, frangipanis are Queensland garden favourites."
  },
  {
    "plantName": "Hibiscus",
    "description": "Hibiscus brings bold, exotic colour to Queensland gardens and loves the warm, sunny conditions of spring. Plant hibiscus in a spot with full sun and rich, well-draining soil. Improve the soil with compost or organic matter before planting. Water regularly to keep the soil moist but not soggy—hibiscus thrives on consistent moisture during the growing season. Mulch to retain water and suppress weeds. Apply a high-potassium fertiliser in spring and summer to support abundant flowering. Protect from strong winds, which can damage the large, delicate blooms. Prune lightly after flowering to encourage new growth and shape the plant. Hibiscus can be grown as shrubs or trained into small trees, making them suitable for hedges or focal points. Their vivid blooms, available in many colours, attract butterflies and brighten any garden. With proper care, hibiscus will flower generously from spring through to autumn in Queensland’s tropical climate."
  },
  {
    "plantName": "Heliconia",
    "description": "Heliconias are lush, dramatic plants perfect for Queensland’s warm and humid spring climate. Known for their bold, banana-like foliage and brightly colored bracts, they thrive in tropical and subtropical zones. Plant in spring in a partly shaded to sunny position with rich, moist, well-draining soil. Add compost or aged manure to enrich the soil. Water regularly—heliconias prefer consistently moist (but not soggy) conditions. Mulch well to retain moisture and suppress weeds. Apply a balanced liquid fertilizer every two weeks during the growing season for lush foliage and prolific flowering. Space plants adequately—around 1–1.5 metres apart—as they form clumping colonies. Prune back old or dead stems at the base to promote new growth. Heliconias make excellent screening plants and create a tropical jungle feel in the garden. Protect from strong winds and frost. With proper care, they’ll reward you with stunning, exotic blooms throughout the warmer months."
  },
  {
    "plantName": "Cordyline",
    "description": "Cordylines are vibrant, foliage-rich plants ideal for adding tropical flair to Queensland gardens in spring. They thrive in warm, humid conditions and prefer filtered sunlight to part shade, though some varieties tolerate full sun. Choose moist, well-draining soil and amend with compost before planting. Water regularly, especially during establishment, but don’t let the soil stay soggy. Cordylines appreciate humidity, so misting can be beneficial in drier areas. Mulch to retain soil moisture and prevent weed growth. Feed monthly during the growing season with a diluted liquid fertilizer high in nitrogen for vibrant foliage color. Remove dead leaves and prune back leggy stems to encourage a bushier shape. With foliage in shades of green, burgundy, pink, and purple, cordylines provide year-round interest. They work beautifully in borders, pots, or as feature plants. Pest-resistant and low-maintenance, cordylines are a fantastic, colorful choice for spring planting in Queensland’s tropical gardens."
  },
  {
    "plantName": "Mango Tree",
    "description": "Mango trees thrive in Queensland’s hot, humid summers and are well-suited to large, sunny backyard spaces. Choose a location with full sun and well-draining soil—mangoes dislike soggy conditions. Summer is a great time to plant as the warm temperatures encourage root growth. Dig a large hole and mix compost into the soil before planting. Water deeply after planting and continue regularly for the first few months. Once established, mangoes become drought-tolerant and need less frequent watering. Apply mulch to conserve moisture and control weeds, keeping it away from the trunk. Fertilise in spring and summer with a balanced fertiliser or one specifically for fruit trees. Prune after harvest to maintain size and airflow. Mango trees can grow large, so consider dwarf varieties for smaller yards. With patience, proper care, and plenty of sunlight, your mango tree will reward you with fragrant flowers and delicious fruit during the warmer months. Banana Tree Banana trees are fast-growing and ideal for Queensland’s tropical summers. They love full sun, high humidity, and fertile, well-draining soil. Choose a sheltered spot out of strong winds, as large leaves can tear easily. Add plenty of compost or organic matter when planting, and space trees about 2–3 metres apart. Keep the soil consistently moist, especially during hot, dry spells—bananas are thirsty plants. Mulch generously to conserve moisture and suppress weeds. Feed regularly with a high-potassium fertiliser to promote fruit production. Bananas grow from a central stem (mother plant) and send up new shoots (suckers). Remove weak suckers and keep 1–2 strong ones to replace the mother plant after fruiting. Fruit usually develops in 12–18 months. Prune dead leaves and remove old stems after harvest. With their tropical look and edible rewards, bananas are a great addition to a productive Queensland backyard."
  },
  {
    "plantName": "Papaya",
    "description": "Papaya is a tropical fruit tree that thrives in Queensland’s summer warmth and abundant rainfall. Plant in a sunny, sheltered location with free-draining soil enriched with compost. Papayas don’t tolerate waterlogging, so raised beds or sandy soils are ideal. Choose a self-pollinating variety or plant multiple trees to ensure good fruit set. Space trees 1.5–2 meters apart to allow room for growth. Water regularly, especially during dry periods, but avoid overwatering. Apply mulch to maintain soil moisture and suppress weeds. Use a balanced fertilizer monthly during the growing season for best results. Papayas grow fast and can bear fruit within 6–12 months. Protect from frost in cooler regions and stake young plants if necessary. Remove yellowing leaves to maintain airflow and reduce disease risk. With minimal care, papaya trees will provide sweet, nutritious fruit and a lush tropical look to your garden."
  },
  {
    "plantName": "Passionfruit Vine",
    "description": "Passionfruit vines flourish in Queensland’s warm summer climate and can quickly transform a fence or trellis into a lush, fruit-laden feature. Plant in a sunny location with well-drained, fertile soil—add compost or aged manure to enrich the planting hole. Install a sturdy support structure before planting, as vines grow rapidly. Space plants at least 2–3 meters apart to allow airflow and access. Water deeply and consistently during dry spells, especially in the first year. Mulch well to retain moisture and prevent weeds. Fertilise every 4–6 weeks with a balanced organic fertiliser to support vine growth and fruiting. Prune in late summer or early autumn to control size and remove dead wood. Passionfruit vines begin producing fruit within 12–18 months and yield best with regular feeding and care. With fragrant flowers, fast growth, and delicious fruit, they’re an ideal addition to productive Queensland backyards."
  },
  {
    "plantName": "Bougainvillea",
    "description": "Bougainvillea is a hardy, vibrant climber that flourishes in Queensland’s warm autumn weather. Plant it in full sun—at least 6 hours daily—for best flowering. Choose well-draining soil, preferably sandy or loamy, and avoid overly rich soil, which can lead to more foliage than flowers. Dig in a little compost to support root development, and position the plant near a fence, wall, or trellis for climbing. Water deeply at planting, then only when the soil is dry—bougainvilleas are drought-tolerant once established. Avoid overwatering. Use a low-nitrogen fertilizer to encourage blooming over leaf growth. Prune lightly after flowering to maintain shape and remove unwanted branches. Watch out for thorns when handling. Bougainvillea’s colourful bracts bloom prolifically from late autumn into spring, attracting pollinators and adding a tropical flair to any garden. With little maintenance and lots of sun, this showstopper thrives in Queensland’s mild autumn climate."
  },
  {
    "plantName": "Thai Basil",
    "description": "Thai Basil thrives in Queensland’s mild, humid autumn and brings spicy-sweet flavour and fragrance to garden beds and pots. Choose a sunny to partly shaded spot with rich, moist, well-draining soil. Autumn planting allows roots to develop before peak harvesting in late spring. Sow seeds or plant seedlings around 20–30 cm apart. Water regularly to keep the soil consistently moist but not soggy. Mulch to conserve moisture and suppress weeds. Pinch off flower buds early to encourage leafy growth and prolong the harvest season. Thai Basil grows quickly, so regular harvesting promotes a bushier plant. Feed monthly with a balanced organic fertiliser. It can be grown in-ground or in pots and pairs well with tomatoes, chillies, and other tropical herbs. Although sensitive to frost, it performs well in Queensland’s autumn warmth. With aromatic leaves perfect for stir-fries and curries, Thai Basil is a rewarding and flavorful backyard herb."
  },
  {
    "plantName": "Taro",
    "description": "Taro is a tropical root vegetable that grows well in Queensland’s warm, wet autumn season. It prefers consistently moist, rich soil and partial shade, though it can tolerate full sun with adequate watering. Choose a planting area near a water source, such as a boggy garden bed or container with good water retention. Plant taro corms or cuttings about 5–10 cm deep and 40–60 cm apart. Water frequently—taro loves wet feet—but ensure some drainage to avoid rot. Add compost or aged manure to the soil before planting, and apply a nitrogen-rich fertiliser every few weeks to support lush leaf and root development. Taro takes 8–12 months to mature, so patience is key. Mulch heavily to retain moisture. In colder regions of Queensland, protect young plants from unexpected chills. With large, tropical leaves and starchy edible roots, taro adds both beauty and function to your autumn garden."
  },
  {
    "plantName": "Lemongrass",
    "description": "Lemongrass thrives in Queensland’s humid autumn and is perfect for edible or ornamental garden beds. It prefers full sun and well-drained soil enriched with compost. Plant lemongrass stalks or clumps about 30–50 cm apart to allow space for the grassy foliage to spread. Autumn planting allows roots to establish before rapid growth in spring. Water regularly during dry spells but avoid soggy soil. Mulch well to retain moisture and suppress weeds. Feed with a liquid fertiliser every 4–6 weeks during the growing season to promote lush, aromatic leaves. Lemongrass grows quickly and can reach up to 1.5 metres tall, making it useful as a windbreak or natural privacy screen. Trim back in late winter to encourage new growth. Harvest outer stalks by cutting them close to the base. Fresh or dried, lemongrass adds citrusy flavour to teas, curries, and stir-fries. Easy to grow and fragrant, it’s a backyard essential."
  },
  {
    "plantName": "Palm Tree",
    "description": "Palm trees are iconic tropical features that grow well in Queensland’s mild winter climate. Winter is an ideal time to plant as temperatures are cooler and rainfall is more consistent, helping roots establish before the intense summer heat. Choose a sunny or partly shaded spot with free-draining soil. Most palms prefer slightly acidic, sandy or loamy soils, and benefit from organic matter like compost. Water regularly during establishment, keeping the soil moist but not waterlogged. Once established, many palm species are drought-tolerant. Mulch around the base to conserve moisture and suppress weeds. Use a slow-release palm-specific fertiliser in spring to support healthy foliage. Remove dead fronds as needed, but avoid heavy pruning. Popular varieties for Queensland include Golden Cane, Bangalow, and Foxtail palms. Their upright structure, lush fronds, and minimal maintenance needs make palms perfect for tropical-style gardens, creating year-round greenery even in the winter months."
  },
  {
    "plantName": "Sweet Potato",
    "description": "Sweet potato is a vigorous, productive crop well-suited to Queensland’s warm, frost-free winters. Plant slips or cuttings in loose, well-drained, sandy soil rich in organic matter. Choose a sunny position and space each plant about 30–40 cm apart, with 80–100 cm between rows. Sweet potatoes thrive in soil temperatures above 18°C, which Queensland winters usually support. Water regularly, especially during the first few weeks, and mulch to retain soil moisture and suppress weeds. Avoid over-fertilising—excess nitrogen leads to leafy growth at the expense of tubers. The vines can sprawl, so give them room or grow them in raised beds or large containers. Harvest typically occurs 4–5 months after planting when leaves begin to yellow. Handle roots gently to prevent bruising. Sweet potatoes are nutritious, easy to grow, and ideal for both ornamental and edible gardens. With minimal care, you’ll enjoy a bountiful, healthy harvest by late spring."
  },
  {
    "plantName": "Jade Plant",
    "description": "Jade Plant (Crassula ovata), a symbol of prosperity, is a hardy succulent perfect for Queensland’s mild, dry winters. Plant in full sun to partial shade in well-drained soil—gritty cactus or succulent mix works best. Winter is a great time to establish new jade plants, especially in frost-free regions. Allow soil to dry out between waterings, as jade is highly drought-tolerant and prone to root rot if overwatered. Avoid watering on cold nights. Use a balanced, diluted liquid fertiliser in early spring to support new growth. Jade plants grow well in pots or in-ground and are ideal for patios or rock gardens. Prune leggy stems to encourage a compact shape and remove dead leaves to prevent pest build-up. Their thick, glossy leaves store moisture and may take on red edges in bright light. With minimal care, jade plants thrive year-round, offering structure and a lush, architectural touch to the garden."
  },
  {
    "plantName": "Okra",
    "description": "Okra is a heat-loving annual that can still be successfully planted in Queensland’s subtropical winter, especially in warmer northern areas. Choose a sunny spot with well-drained, fertile soil enriched with compost or aged manure. Sow seeds directly into the soil or transplant seedlings once the soil warms to at least 18–20°C. Space plants 30–40 cm apart in rows 60–90 cm apart. Water consistently, especially during dry spells, but avoid overwatering. Mulch around plants to retain moisture and control weeds. Okra grows quickly and begins flowering within 6–8 weeks. Harvest young pods regularly while they are tender (about 5–8 cm long) to encourage further production. Wear gloves when harvesting, as the pods and leaves can be irritating to some skin types. With stunning hibiscus-like flowers and nutritious pods, okra is both ornamental and edible—an ideal crop for productive Queensland gardens in winter."
  },
  {
    "plantName": "Eremophila",
    "description": "Eremophila, or Emu Bush, is a hardy Australian native ideal for South Australia’s dry spring conditions. It thrives in full sun and well-draining soil, including sandy or gravelly types. Spring is an excellent time to plant, giving the roots time to establish before summer heat. Eremophila is drought-tolerant and low-maintenance—water occasionally during dry spells, especially in the first year. Avoid overwatering and do not plant in waterlogged areas. It rarely needs fertiliser, but a native plant mix can be used in spring. Light pruning after flowering helps maintain a compact shape and encourages new blooms. Eremophila varieties offer a range of colours, from purple and pink to yellow and red, often attracting birds and pollinators. Their tough nature makes them perfect for low-water, low-care native gardens in South Australia. With striking flowers and silvery foliage, Eremophilas are a beautiful and resilient feature in spring landscapes."
  },
  {
    "plantName": "Correa",
    "description": "Correa, also known as Native Fuchsia, is a charming, low-growing native plant that thrives in South Australia's springtime gardens. It prefers part shade to full sun and does well in well-draining, sandy or loamy soils. Correa is perfect for coastal or inland areas, tolerating wind and light frost. Plant in spring when soil warmth supports root development. Water regularly during establishment, then reduce frequency—Correa is drought-tolerant once mature. It responds well to mulching and benefits from light pruning after flowering to maintain shape. Its delicate, bell-shaped flowers bloom in soft shades of pink, red, or green, attracting native birds like honeyeaters. Correa suits rockeries, understorey plantings, or borders, and its tidy, compact form requires little upkeep. Ideal for wildlife gardens and low-maintenance landscapes, this native shrub adds subtle beauty and biodiversity to spring gardens across South Australia."
  },
  {
    "plantName": "Leucophyta brownii",
    "description": "Leucophyta brownii, commonly known as Cushion Bush, is a South Australian coastal native that thrives in harsh, dry spring conditions. Its striking silver foliage and rounded form make it a standout in low-water gardens. Plant in full sun and free-draining soil—avoid clay or poorly drained locations. It’s particularly suited to coastal environments due to its salt and wind tolerance. Cushion Bush needs minimal watering once established and does not require fertilising. Plant in spring for the best root establishment before summer. The plant maintains a compact, spherical shape naturally, but light pruning can keep it tidy. It produces small, yellowish-white flowers in late spring to summer. Leucophyta pairs well with other natives or succulents and provides excellent contrast in rock gardens and modern landscapes. Its drought resistance, low maintenance, and sculptural appearance make it an ideal feature for spring gardens in South Australia."
  },
  {
    "plantName": "Callistemon",
    "description": "Callistemon 'Captain Cook' is a compact, eye-catching cultivar of the classic Bottlebrush, perfect for South Australia’s spring planting. It loves full sun and performs best in well-draining, slightly acidic soils, though it tolerates a range of conditions. Spring planting helps roots establish before summer. Water regularly during the first year, then reduce as it becomes drought-tolerant. Mulch around the base to retain moisture and suppress weeds. Feed in spring with a low-phosphorus native fertiliser to support vibrant growth. 'Captain Cook' grows into a dense shrub about 1.5–2 metres tall, with vivid red bottlebrush flowers appearing in spring and again in summer. These flowers attract bees, butterflies, and nectar-feeding birds, making it a wonderful choice for wildlife-friendly gardens. Light pruning after flowering maintains its shape and encourages further blooms. Hardy, colourful, and low-maintenance, this cultivar is ideal for hedging, borders, or feature planting in South Australian spring gardens."
  },
  {
    "plantName": "Aloe Vera",
    "description": "Aloe Vera is an ideal plant for South Australia’s hot, dry summers. It thrives in full sun to light shade and prefers well-draining, sandy soil. Plant aloe in summer when warmth supports active root growth. Avoid clay soils—use cactus or succulent mix if needed. Aloe stores water in its fleshy leaves, so it needs only occasional watering. Allow the soil to dry out completely between watering, and avoid wetting the crown to prevent rot. Aloe Vera does well in pots or garden beds and can be brought indoors in colder months if frost is a risk. No fertiliser is needed, but a light feed with diluted liquid fertiliser in spring can support growth. Propagate from pups that form at the base of mature plants. With its healing gel and minimal care needs, Aloe Vera is a practical, attractive, and low-maintenance addition to any drought-resilient South Australian summer garden."
  },
  {
    "plantName": "Zucchini",
    "description": "Zucchini is a fast-growing, heat-loving vegetable perfect for South Australia’s long, sunny summers. Plant seeds or seedlings in full sun and rich, well-draining soil enriched with compost or aged manure. Space plants about 70–90 cm apart to allow air circulation and prevent fungal issues. Water deeply at the base every few days, keeping the soil evenly moist but not soggy. Avoid wetting the leaves to reduce the risk of powdery mildew. Mulch around plants to retain moisture and suppress weeds. Feed every 2–3 weeks with a liquid fertiliser high in potassium to support flowering and fruiting. Harvest zucchini when young (10–15 cm long) for the best texture and flavour. Pick regularly to encourage continuous production. Zucchini grows well in raised beds, veggie patches, or even large containers. With proper care, you’ll enjoy an abundant, fast-producing crop throughout the summer months in South Australian backyards."
  },
  {
    "plantName": "Fig Tree",
    "description": "Fig trees thrive in South Australia’s hot, dry summers, making them a rewarding addition to backyard orchards. Choose a sunny, sheltered spot with well-drained soil—figs dislike waterlogged conditions. Plant bare-root or potted trees in summer, ensuring roots are spread and the crown is level with the soil surface. Water regularly during establishment, then reduce as the tree matures—figs are drought-tolerant but produce better with consistent moisture. Mulch heavily around the base to retain soil moisture and suppress weeds. Feed with compost or a balanced fertiliser in late spring or early summer. Prune in late winter to maintain shape and improve airflow. Figs typically bear fruit in summer and autumn; harvest when soft and sweet-smelling. Netting may be needed to protect fruit from birds. With its sculptural form, delicious fruit, and low maintenance needs, the fig tree is perfectly suited to South Australia’s Mediterranean-style summers."
  },
  {
    "plantName": "Artichoke",
    "description": "Artichokes are striking and productive perennials well-suited to South Australia’s summer climate. They thrive in full sun and fertile, well-draining soil with plenty of organic matter. Plant crowns or seedlings in summer, spacing them 80–100 cm apart to allow for their large, arching foliage. Water deeply and consistently, especially during hot, dry periods—artichokes need regular moisture to form tender buds. Mulch around the base to conserve water and reduce weed competition. Feed every few weeks with a liquid fertiliser rich in nitrogen to encourage vigorous leaf and bud growth. Artichokes can take up to a year to fully mature, but in warm climates like South Australia, they often produce buds in the first growing season. Harvest flower buds when they are still tightly closed—usually late summer to autumn. Leave a few to bloom if desired—their purple thistle-like flowers are a stunning ornamental feature in any summer garden."
  },
  {
    "plantName": "Nectarine Tree",
    "description": "Nectarine trees thrive in South Australia’s Mediterranean climate, and autumn is an excellent time to plant them. The cooler temperatures help young trees establish roots before the heat of summer returns. Choose a sunny location with well-draining, fertile soil. Avoid frost pockets and ensure good airflow to reduce fungal disease risk. Dig a wide hole and mix compost or aged manure into the soil. Water deeply after planting and continue regularly until winter rains begin. Mulch around the base to retain moisture, keeping it clear of the trunk. Nectarines benefit from winter pruning to encourage fruiting spurs and a strong shape. Fertilise in late winter or early spring with a balanced fruit tree fertiliser. Expect harvests in late summer, with juicy fruit varieties ranging from yellow to white flesh. Nectarine trees also produce lovely spring blossoms, making them a dual-purpose tree for beauty and backyard productivity."
  },
  {
    "plantName": "Rocket (Arugula)",
    "description": "Rocket (Arugula) is a fast-growing leafy green perfect for South Australia’s mild autumn weather. It prefers full sun to part shade and grows best in well-drained, fertile soil enriched with compost. Sow seeds directly into garden beds or pots, spacing them 10–15 cm apart. Water lightly and regularly to keep the soil moist. Rocket germinates quickly in cool weather and can be harvested in as little as 3–4 weeks. For a continuous supply, sow a new batch every 2–3 weeks during autumn. Harvest outer leaves when they are young and tender, or cut the whole plant just above the base. Rocket has a peppery flavour and is excellent in salads, sandwiches, and pesto. To reduce bitterness, pick leaves before the plant bolts in warm weather. As a cool-season crop, rocket thrives with minimal fuss and is a great option for beginner gardeners in autumn."
  },
  {
    "plantName": "French Lavender",
    "description": "French Lavender (Lavandula dentata) is a hardy, fragrant shrub that suits South Australia’s dry autumns and is ideal for Mediterranean-style gardens. Plant in full sun with well-draining, slightly alkaline soil—avoid clay-heavy or soggy locations. Autumn planting gives lavender time to establish before summer. Space plants about 60 cm apart to ensure airflow, which helps prevent fungal issues. Water young plants regularly, but once established, lavender becomes drought-tolerant and needs minimal watering. Avoid high-nitrogen fertilisers—use a low-phosphorus mix in spring if needed. Prune after flowering to maintain shape and encourage new growth. French lavender blooms for long periods and its grey-green foliage adds year-round appeal. It’s great for borders, hedges, pots, and bee-friendly gardens. With its beautiful flowers and calming scent, French lavender is both ornamental and practical—an ideal choice for low-maintenance autumn planting in South Australia."
  },
  {
    "plantName": "Oregano",
    "description": "Oregano is a tough, aromatic herb that thrives in South Australia’s dry, mild autumns. Plant in full sun in well-drained, slightly alkaline soil. Autumn planting gives oregano a chance to develop strong roots before winter dormancy. Space plants 20–30 cm apart and water regularly during establishment. Once mature, oregano is drought-tolerant and rarely needs feeding—too much fertiliser can reduce flavour intensity. Oregano grows well in garden beds or pots and benefits from occasional trimming to encourage bushy growth. Harvest leaves as needed, ideally before flowering, for the best flavour. It pairs beautifully with tomatoes, meats, and Mediterranean dishes. In cooler parts of South Australia, oregano may die back in winter but will regrow in spring. Mulch lightly to protect the roots from cold snaps. With its rich aroma, culinary versatility, and easy care, oregano is a perfect autumn addition to productive or ornamental backyard gardens."
  },
  {
    "plantName": "Rosemary",
    "description": "Rosemary is a hardy, evergreen herb that thrives in South Australia’s cool, sunny winters. Plant in full sun with free-draining, slightly alkaline soil—avoid clay-heavy or soggy ground. Winter is an ideal time to plant as rosemary grows slowly and benefits from the milder weather. Space plants 50–100 cm apart depending on the variety. Water regularly during establishment, then reduce frequency—rosemary is highly drought-tolerant once mature. Mulch lightly to suppress weeds and maintain even moisture. Prune after flowering to maintain shape and promote bushiness. Avoid high-nitrogen fertilisers; instead, use compost or a light organic feed in spring. Rosemary grows well in pots or garden beds and provides year-round flavour for roasts, stews, and breads. Its aromatic leaves also deter pests and attract pollinators when in bloom. Tough, attractive, and versatile, rosemary is an essential addition to winter herb gardens in South Australia."
  },
  {
    "plantName": "Westringia",
    "description": "Westringia, or Native Rosemary, is a hardy Australian shrub perfectly suited to South Australia’s cool, dry winters. It thrives in full sun to part shade and tolerates a wide range of soil types, including poor or sandy soils, provided they drain well. Plant in winter to allow roots to establish before summer. Water regularly during the first year, then reduce as it becomes drought-tolerant. Prune lightly after flowering to encourage dense growth and maintain a neat, rounded shape. Westringia produces pale lilac to white flowers throughout much of the year, especially in winter and spring, and attracts pollinators like bees. It works beautifully as a low-maintenance hedge, border, or native feature plant. Westringia requires very little fertiliser—apply a low-phosphorus native mix in spring if needed. With its resilience, tidy form, and soft flowers, it’s an excellent choice for winter planting in South Australia’s coastal and inland gardens."
  },
  {
    "plantName": "Kale",
    "description": "Kale is a nutrient-rich leafy green that flourishes in South Australia’s mild winters. It prefers full sun but tolerates partial shade and grows best in fertile, well-drained soil enriched with compost or aged manure. Sow seeds or plant seedlings 30–40 cm apart in rows spaced 50 cm apart. Water regularly to keep the soil consistently moist, especially during dry winter periods. Mulch to reduce weeds and retain moisture. Feed fortnightly with a liquid seaweed or organic fertiliser to promote leafy growth. Kale is cold-hardy and sweeter after light frosts, making winter the perfect time to grow it. Harvest outer leaves when they’re around 15–20 cm long, leaving the centre to keep producing. Remove yellowing or damaged leaves to maintain plant health. Ideal for salads, soups, and stir-fries, kale is easy to grow and highly productive through the cooler months in South Australian gardens."
  },
  {
    "plantName": "Sage",
    "description": "Sage is a hardy, aromatic herb that loves South Australia’s sunny, dry winters. It grows best in full sun and well-drained, sandy or loamy soil with moderate fertility. Winter is a good time to plant sage, as the cool weather helps it establish roots without bolting. Space plants 30–50 cm apart and water regularly during establishment, then only when the topsoil is dry—sage dislikes wet feet. Avoid high-nitrogen fertilisers; compost or a slow-release herb feed in spring is sufficient. Sage thrives in pots or garden beds and adds a silvery, textured look to herb gardens. Prune back lightly in early spring to keep the plant compact and encourage new growth. Harvest leaves regularly to encourage bushiness and prevent flowering. The leaves have a strong, earthy flavour, perfect for roasts, stuffings, and teas. Easy-care and beautifully aromatic, sage is an excellent winter herb for South Australian gardens."
  }
]